packages/helpers/woc-api/test/perf_test/woc_post_hex_vout_1000rps_singleEndpoint.yml
execution:
  - executor: locust
  throughput: 10000
  hold-for: 2s
  scenario: post-requests

scenarios:
  post-requests:
    timeout: 5s
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/txs/vouts/hex
        method: POST
        headers:
          Content-Type: "application/json"
        body: |
          {
            "txids": [
              {
                "txid": "e8022f0904e636a7f4c1e561ca0af794b354f6fb71bdfb57b5ac3528e3f40e2f",
                "vouts": [
                  0,
                  1
                ]
              }
            ]
          }

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    class: bzt.modules.locust.LocustIOExecutor