packages/helpers/woc-api/test/perf_test/woc_post_links_1000rps_singleEndpoint.yml
execution:
- executor: locust
  throughput: 10000
  hold-for: 2s
  scenario: post-requests

scenarios:
  post-requests:
    timeout: 5
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/search/links
        method: POST
        headers:
          Accept: "Content-Type: application/json"
          Authorization: mainnet_2975d2afeb0b46f9e249f035949e700a
        body:
           query: 1GJ3x5bcEnKMnzNFPPELDfXUCwKEaLHM5H
           
reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: