packages/helpers/woc-api/test/perf_test/woc_post_scriptsunspent_1000rps_singleEndpoint.yml
execution:
- executor: locust
  throughput: 10000
  hold-for: 2s
  scenario: post-requests

scenarios:
  post-requests:
    timeout: 5
    requests:
      - url: https://api-ovh.whatsonchain.com/v1/bsv/main/scripts/unspent
        method: POST
        headers:
          Accept: "Content-Type: application/json"
          Authorization: mainnet_2975d2afeb0b46f9e249f035949e700a
        body:
           scripts: ["b77984b45c05625cf814a7c3a40164aacc440871e8b7b14eb6a45f0ca7dcbeaea709edc83274c5e7673c1ff728af2c4b4cf230eb35e9feccc8c01b5919cd7bb7","995ea8d0f752f41cdd99bb9d54cb004709e04c7dc4088bcbbbb9ea5c390a43c3" ]

reporting:
  - module: final-stats
  - module: console
  - module: junit-xml
    filename: reports-junit-format.xml
    data-source: sample-labels

modules:
  locust:
    cmdline: